RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_sdioc.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_sdioc.c
 **
 ** A detailed description is available at
 ** @link SdiocGroup SDIOC description @endlink
 **
 **   - 2018-11-11 CDT First version for Device Driver Library of SDIOC.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_sdioc.h"
#include "hc32f460_utility.h"

#if (DDL_SDIOC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup SdiocGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief SDIOC internal data
 **
 ******************************************************************************/
typedef struct stc_sdioc_intern_data
{
    stc_sdioc_normal_irq_cb_t stcNormalIrqCb;   ///< Normal irq callback function structure

    stc_sdioc_error_irq_cb_t  stcErrorIrqCb;    ///< Error irq callback function structure
} stc_sdioc_intern_data_t;

/**
 *******************************************************************************
 ** \brief SDIOC instance data
 **
 ******************************************************************************/
typedef struct stc_sdioc_instance_data
{
    const M4_SDIOC_TypeDef  *SDIOCx;        ///< pointer to registers of an instance

    stc_sdioc_intern_data_t stcInternData;  ///< module internal data of instance
} stc_sdioc_instance_data_t;

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for SDIOC Instances. */
#define IS_VALID_SDIOC(__SDIOCx__)                                             \
(   (M4_SDIOC1 == (__SDIOCx__))             ||                                 \
    (M4_SDIOC2 == (__SDIOCx__)))

/*!< Parameter valid check for SDIOC mode. */
#define IS_VALID_SDIOC_MODE(x)                                                 \
(   (SdiocModeSD == (x))                    ||                                 \
    (SdiocModeMMC == (x)))

/*!< Parameter valid check for SDIOC Response Register. */
#define IS_VALID_SDIOC_RESP(x)                                                 \
(   (SdiocRegResp01 == (x))                 ||                                 \
    (SdiocRegResp23 == (x))                 ||                                 \
    (SdiocRegResp45 == (x))                 ||                                 \
    (SdiocRegResp67 == (x)))

/*!< Parameter valid check for SDIOC bus width. */
#define IS_VALID_SDIOC_BUS_WIDTH(x)                                            \
(   (SdiocBusWidth1Bit == (x))              ||                                 \
    (SdiocBusWidth4Bit == (x))              ||                                 \
    (SdiocBusWidth8Bit == (x)))

/*!< Parameter valid check for SDIOC speed mode. */
#define IS_VALID_SDIOC_SPEED_MODE(x)                                           \
(   (SdiocHighSpeedMode   == (x))           ||                                 \
    (SdiocNormalSpeedMode == (x)))

/*!< Parameter valid check for SDIOC Clock division. */
#define IS_VALID_SDIOC_CLK_DIV(x)                                              \
(   (SdiocClkDiv_1   == (x))                ||                                 \
    (SdiocClkDiv_2   == (x))                ||                                 \
    (SdiocClkDiv_4   == (x))                ||                                 \
    (SdiocClkDiv_8   == (x))                ||                                 \
    (SdiocClkDiv_16  == (x))                ||                                 \
    (SdiocClkDiv_32  == (x))                ||                                 \
    (SdiocClkDiv_64  == (x))                ||                                 \
    (SdiocClkDiv_128 == (x))                ||                                 \
    (SdiocClkDiv_256 == (x)))

/*!< Parameter valid check for SDIOC command type. */
#define IS_VALID_SDIOC_CMD_TYPE(x)                                             \
(   (SdiocCmdAbort  == (x))                 ||                                 \
    (SdiocCmdResume == (x))                 ||                                 \
    (SdiocCmdNormal  == (x))                ||                                 \
    (SdiocCmdSuspend   == (x)))

/*!< Parameter valid check for SDIOC data transfer direction. */
#define IS_VALID_SDIOC_TRANSFER_DIR(x)                                         \
(   (SdiocTransferToCard == (x))            ||                                 \
    (SdiocTransferToHost == (x)))

/*!< Parameter valid check for SDIOC software reset type. */
#define IS_VALID_SDIOC_SWRESETTYPE(x)                                          \
(   (SdiocSwResetAll     == (x))            ||                                 \
    (SdiocSwResetCmdLine == (x))            ||                                 \
    (SdiocSwResetDatLine == (x)))

/*!< Parameter valid check for SDIOC data transfer mode. */
#define IS_VALID_SDIOC_TRANSFER_MODE(x)                                        \
(   (SdiocTransferSingle       == (x))      ||                                 \
    (SdiocTransferInfinite     == (x))      ||                                 \
    (SdiocTransferMultiple     == (x))      ||                                 \
    (SdiocTransferStopMultiple == (x)))

