RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_sdioc.c
/*!< Parameter valid check for SDIOC data timeout. */
#define IS_VALID_SDIOC_DATA_TIMEOUT(x)                                         \
(   (SdiocDtoSdclk_2_13 == (x))             ||                                 \
    (SdiocDtoSdclk_2_14 == (x))             ||                                 \
    (SdiocDtoSdclk_2_15 == (x))             ||                                 \
    (SdiocDtoSdclk_2_16 == (x))             ||                                 \
    (SdiocDtoSdclk_2_17 == (x))             ||                                 \
    (SdiocDtoSdclk_2_18 == (x))             ||                                 \
    (SdiocDtoSdclk_2_19 == (x))             ||                                 \
    (SdiocDtoSdclk_2_20 == (x))             ||                                 \
    (SdiocDtoSdclk_2_21 == (x))             ||                                 \
    (SdiocDtoSdclk_2_22 == (x))             ||                                 \
    (SdiocDtoSdclk_2_23 == (x))             ||                                 \
    (SdiocDtoSdclk_2_24 == (x))             ||                                 \
    (SdiocDtoSdclk_2_25 == (x))             ||                                 \
    (SdiocDtoSdclk_2_26 == (x))             ||                                 \
    (SdiocDtoSdclk_2_27 == (x)))

/*!< Parameter valid check for SDIOC Response type name. */
#define IS_VALID_SDIOC_RESP_TYPE_NAME(x)                                       \
(   (SdiocCmdRspR1  ==  (x))                ||                                 \
    (SdiocCmdRspR1b ==  (x))                ||                                 \
    (SdiocCmdRspR2  ==  (x))                ||                                 \
    (SdiocCmdRspR3  ==  (x))                ||                                 \
    (SdiocCmdRspR4  ==  (x))                ||                                 \
    (SdiocCmdRspR5  ==  (x))                ||                                 \
    (SdiocCmdRspR5b ==  (x))                ||                                 \
    (SdiocCmdRspR6  ==  (x))                ||                                 \
    (SdiocCmdRspR7  ==  (x))                ||                                 \
    (SdiocCmdNoRsp  ==  (x)))

/*!< Parameter valid check for SDIOC data timeout. */
#define IS_VALID_SDIOC_HOST_STATUS(x)                                          \
(   (SdiocCmdPinLvl           == (x))       ||                                 \
    (SdiocData0PinLvl         == (x))       ||                                 \
    (SdiocData1PinLvl         == (x))       ||                                 \
    (SdiocData2PinLvl         == (x))       ||                                 \
    (SdiocData3PinLvl         == (x))       ||                                 \
    (SdiocCardInserted        == (x))       ||                                 \
    (SdiocDataLineActive      == (x))       ||                                 \
    (SdiocCardStateStable     == (x))       ||                                 \
    (SdiocBufferReadEnble     == (x))       ||                                 \
    (SdiocBufferWriteEnble    == (x))       ||                                 \
    (SdiocCardDetectPinLvl    == (x))       ||                                 \
    (SdiocCommandInhibitCmd   == (x))       ||                                 \
    (SdiocWriteProtectPinLvl  == (x))       ||                                 \
    (SdiocCommandInhibitData  == (x))       ||                                 \
    (SdiocReadTransferActive  == (x))       ||                                 \
    (SdiocWriteTransferActive == (x)))

/*!< Parameter valid check for SDIOC normal interrupt. */
#define IS_VALID_SDIOC_NOR_INT(x)                                              \
(   (SdiocCardInt          == (x))          ||                                 \
    (SdiocErrorInt         == (x))          ||                                 \
    (SdiocCardRemoval      == (x))          ||                                 \
    (SdiocBlockGapEvent    == (x))          ||                                 \
    (SdiocCardInsertedInt  == (x))          ||                                 \
    (SdiocCommandComplete  == (x))          ||                                 \
    (SdiocBufferReadReady  == (x))          ||                                 \
    (SdiocBufferWriteReady == (x))          ||                                 \
    (SdiocTransferComplete == (x)))

/*!< Parameter valid check for SDIOC error interrupt. */
#define IS_VALID_SDIOC_ERR_INT(x)                                              \
(   (SdiocCmdCrcErr        == (x))          ||                                 \
    (SdiocDataCrcErr       == (x))          ||                                 \
    (SdiocCmdIndexErr      == (x))          ||                                 \
    (SdiocCmdEndBitErr     == (x))          ||                                 \
    (SdiocAutoCmd12Err     == (x))          ||                                 \
    (SdiocCmdTimeoutErr    == (x))          ||                                 \
    (SdiocDataEndBitErr    == (x))          ||                                 \
    (SdiocDataTimeoutErr   == (x)))

/*!< Parameter valid check for SDIOC auto CMD12 error status. */
#define IS_VALID_SDIOC_AUTOCMD_ERR(x)                                          \
(   (SdiocCmdNotIssuedErr      == (x))      ||                                 \
    (SdiocAutoCmd12CrcErr      == (x))      ||                                 \
    (SdiocAutoCmd12Timeout     == (x))      ||                                 \
    (SdiocAutoCmd12IndexErr    == (x))      ||                                 \
    (SdiocAutoCmd12EndBitErr   == (x))      ||                                 \
    (SdiocAutoCmd12NotExecuted == (x)))

/*!< Parameter valid check for SDIOC detect card signal. */
#define IS_VALID_SDIOC_DETECT_SIG(x)                                           \
(   (SdiocSdcdPinLevel == (x))              ||                                 \
    (SdiocCardDetectTestLevel == (x)))

